all_cars = [
    ['Ford', 'GT', 2017, 8.6, 8.4, 7.5, 9, 8.9, 470, 731, 1311, 43, 3500, 'RWD', 900, 400000,2.90,5.50,364.3,35.8,84.8,1.12,1.27,{'c01':'3.000к','c02':1,'c03':'5%','c04':1, 'c05':'10%','c06':'150%','c07':'10%', 'c08':'20%', 'c09':1, 'c10':'30%', 'c11':'30%','c12':'30%', 'c13':'20%'}],
    ['Dodge', 'challengeer R/T', 1970, 6.2, 4.7, 5.2, 6.5, 4.4, 317, 664, 1724, 58, 6982, 'RWD', 562, 210000,6.30,12.30,241.1,62.4,151.4,0.74,0.73,{'c01':'3.000к', 'c14':6,'c015':'10%' ,'c04':1,'c16':'5.000к','c17':'20%','c18':'15%','c19':1,'c14':7,'c20':'1.0сек', 'c09':1,'c21':'200%','c03':'30%'}],
    ['Ferrari', '599 GTO', 2010, 8.3, 7.9, 7.3, 8.9, 8.5, 493, 620, 1605, 47, 5999, 'RWD', 863, 690000,3.36,7.21,352.6,38.2,91.4,1.08,1.19,{'c01':'3.000к','c02':1,'c03':'5%','c04':1, 'c05':'10%','c06':'150%','c07':'10%', 'c08':'20%', 'c09':1, 'c10':'30%', 'c11':'30%','c12':'30%', 'c13':'20%'}],
    ['Audi', 'TTS Coupe', 2015, 7.4, 6.4, 7.3, 9.0, 5.8, 231, 380, 1385, 57, 1984, 'AWD', 740, 52000,5.12,12.82,301.1,50.2,123.7,0.91,0.94,{'c22':'2.000к', 'c07':'5%', 'c05':'5%', 'c04':1, 'c08':'20%','c11':'20%','c06':'150%', 'c19':1,'c10':'30%', 'c13':'5%','c03':'20%'}],
    ['Ford', 'Focus RS', 2017, 6.9, 6.3, 7.3, 9.2, 6.5, 261, 475, 1563, 59, 2261, 'AWD', 718, 59000,4.40,11.20,278.6,46.8,113.8,0.89,0.92,{'c22':'2.000к', 'c24':'5%','c25':'250%','c04':1, 'c18':'15%','c19':1,'c13':'10%', 'c16':'7.500к', 'c26':'20%', 'c17':'30%','c21':'150%'}],
    ['Dodge', 'Charger R/T', 1969, 5.9, 4.7, 5.3, 6.8, 4.3, 317, 665, 1665, 54, 6981, 'RWD', 558, 103000,6.00,16.0,226.9,61.6,151.3,0.73,0.73,{'c22':'2.000к','c14':6,'c03':'5%','c04':1, 'c19':1,'c18':'15%','c23':'10%', 'c21':'100%', 'c08':'30%', 'c16':'7.500к', 'с10':'30%'}],
    ['Ferrari', '488 GTB', 2015, 8.5, 8.1, 7.5, 9.1, 8.7, 492, 760, 1475, 42, 3902, 'RWD', 883, 29000,2.80,5.70,360.8,37.1,89.6,1.08,1.22,{'c01':'3.000к','c02':1,'c13':'5%','c04':1, 'c05':'10%','c06':'150%','c07':'10%', 'c08':'20%', 'c09':1, 'c10':'30%', 'c11':'30%','c12':'30%', 'c13':'20%'}],
    ['Audi', 'RS7 Sportback', 2013, 8.0, 6.1, 8.3, 9.9, 6.5, 412, 750, 1955, 60, 3993, 'AWD', 761, 225000,3.70,8.7,330.9,48.9,113.0,0.89,0.90,{'c27':'5.000к', 'c28':'2x', 'c16':'7.500к', 'c04':1, 'c11':'20%', 'c03':'10%', 'c26':'10%', 'c10':'20%','c17':'30%','с29':'30%', 'c07':'15%', 'c30':1, 'c31':'20%', 'c32':1,'c16':'10.000к', 'c33':1}],
    ['Audi', 'R8 Coupe V10 PLUS 5.2 FSI QUATTRO', 2013,7.8,7.2,8.5,9.5,7.7,404,540,1670,44,5204,'AWD', 824, 290000,3.2,7.1,326.0,38.7,95.5,0.96,1.04,{'c22':'2.000к','c14':6,'c03':'5%','c04':1, 'c19':1,'c18':'15%','c23':'10%', 'c21':'100%', 'c08':'30%', 'c16':'7500к', 'с10':'30%'}],
    ['Ford', 'Escort RS Cosworth', 1992, 6.0, 5.3, 6.0, 8.0, 5.3, 167, 304, 1275, 56, 1993, 'AWD', 566, 66000,6.2,17.4,231.8,48.6,120.4,0.86,0.87,{'c22':'2.000к','c28':'2x','c07':'5%', 'c04':1,'c10':'20%','c11':'20%', 'c26':'10%','c19':1, 'c31':'10%', 'с29':'30%', 'c17':'30%'}],
    ['Dodge','Charger SRT Hellcat',2015, 8.2,6.1,6.1,7.7,6.5,527,882,2075,54,6166,'RWD',785,80000,3.40,7.20,337.3,47.3,111.5,0.89,0.90,{'c01':'3.000к','c18':'10%','c34':'10%','c04':1,'c19':1,'c13':'10%','c25':'300%','c09':1,'c26':'20%','c17':'30%','c24':'20%','c16':'10.000к','c21':'200%'}],
    ['Ferrari','California',1957,6.2,4.6,5.2,6.0,4.5,195,256,1050,52,2953,'RWD',540,8000000,6.5,14.7,239.3,61.5,152.4,0.73,0.72,{'c27':'5.000к', 'c28':'5.000к', 'c16':'2x', 'c04':1,'c14':6, 'c19':1, 'c20':'0.5 сек','c35':'30.000$','c36':'20%','c08':'30%','c13':'20%', 'c18':'25%','c21':'200%', 'c10':'40%', 'c33':1, 'c23':'30%'}],
]

keys_prizes = {
    'c01':'Выигрышь в лотерею',
    'c02':'Улыбка фортуны',
    'c03':'Великий комбинатор',
    'c04':'Дополнительная жизнь',
    'c05':'Мастер тройного обгона',
    'c06':'Concours D"elegance',
    'c07':'Гвоздь программы',
    'c08':'Авантюрист',
    'c09':'Дополнительное оборудование',
    'c10':'Абсолютная скорость',
    'c11':'Мастер обгона',
    'c12':'Снижая сопротивление',
    'c13':'Шоссейный гонщик',
    'c14':'Легенда',
    'c15':'Любимчик колонны',
    'c16':'Выпендреж',
    'c17':'Прирожденный дрифтер',
    'c18':'Отжигай',
    'c19':'Король барабана',
    'c20':'Шоу на века',
    'c21':'Любимец фанатов',
    'c22':'Игрушка на выходные',
    'c23':'Водитель-сорвиголова',
    'c24':'Везунчик',
    'c25':'Тук-Тук',
    'c26':'Убойный дрифт',
    'c27':'Гордость коллекции',
    'c28':'Невероятная управляемость',
    'c29':'Летающая машина',
    'c30':'Время призов',
    'c31':'Грязевой монстр',
    'c32':'Особенно удачлив',
    'c33':'Должно повезти',
    'c34':'Сокрушительное оружие',
    'c35':'Посмотрите в бардачке',
    'c36':'Просрто Идеал',
}

all_cars.sort()
while all_cars:
    i = 0
    brands = []
    while i < len(all_cars):
        if all_cars[i][0] not in brands:
            brands.append(all_cars[i][0])
        i+=1
    print(*brands, sep='\n')
    print('')
    try:
        enter_brand = input("Выберите марку: \n")
    except EOFError:
        break

    i = 0
    brand_cars = []
    while i < len(all_cars):
        if enter_brand in all_cars[i][0]:
            brand_cars.append(all_cars[i][0:3])
        i+=1

    for m,ml,y in brand_cars:
        text1 = f'''
    {m}
    {ml}
    {y}
    '''
        print(text1)
    try:
        model = input("Введите модель: \n")
    except EOFError:
        break
    try:
        year = int(input("Введите год: \n"))
    except EOFError:
        break

    i = 0
    car = []
    while i < len(all_cars):
        if model == all_cars[i][1] and year == all_cars[i][2]:
            # if year == all_cars[i][2]:
                car.append(all_cars[i][:])
        i+=1

    for m, ml, y, s, c, ac, st, fn, pw, hm, kg, proc, v, o, i, pc, ac97, ac161, spd, brk97,brk161,side97,side193,star in car:
        ph = int(pw * 1.3596)
        ph_kg = (f'{ph / kg:.1f}')
        options = f'''
            марка                   {m}         
            модель:                 {ml}
            год                     {y}
            скорость:               {s}
            управление:             {c}
            ускорение:              {ac}
            разгон:                 {st}
            торможение:             {fn}
            мощность:               {pw} кВт
            мощность:               {ph} Лс
            крутящий момент:        {hm} Н.м.
            Вес:                    {kg} кг
            Мощность/масса          {ph_kg} Лс на 1кг
            фронтальная нагрузка:   {proc} %
            объем двигателя:        {v}
            привод:                 {o}
            класс:                  {i}
            цена:                   {pc}
            Величина ускорения:
            - 0-97 км/ч             {ac97} сек.
            - 0-161 км/ч            {ac161} сек.
            максимальная скорость   {spd} км/ч
            тормозной путь:         
             - 97км/ч-0             {brk97} м
            - 161км/ч-0             {brk161} м
            Боковые перегрузки:     
            - 97км/ч                {side97}
            - 193км/ч               {side193}
        '''

        print(options)


    # i = 0
    # car_pr = {}
    # while i < len(all_cars):
    #     if model == all_cars[i][1]:
    #         if year == all_cars[i][2]:
    #             car_pr.update(all_cars[i][-1])
    #     i += 1
    #
    # for key in keys_prizes:
    #     if key in car_pr:
    #         print(keys_prizes[key],car_pr[key])
print('')

